# About
about_title=关於
content=86ME 为一开源专案，由 RoBoard 魔人之 RoBoME 衍生而来。(https://github.com/RoBoardGod/RoBoME)
author_label_Text=作者：RoBoardGod
license_label_Text=授权方式：GNU GPL V2
version_label_Text=版本：2.2.0, 2018/10/12
language=zh
# Main
aboutToolStripMenuItem_Text=关於
acc_groupBox_Text=加速度计
Action_groupBox_Text=动作指令
ActionList_Text=指令列表
actionToolStripMenuItem_Text=读取专案
AddHomeframe=加入 Homeframe
AddNewAction_F=在列表顶端加入新指令
AddNewAction_N=在指令下方加入新指令
AdvanceTab_Text=进阶选项
AlwaysOff_ToolTip=此动作永不触发
AlwaysOn_ToolTip=此动作持续触发
analog_groupBox_Text=类比讯号
autocheck_Text=同步舵机
autocheck_ToolTip=编辑时同步响应
blockingExplaination_Text=此动作执行时不能被其他动作中断
bt_groupBox_Text=蓝芽
btBaudCombo_ToolTip=选择蓝芽模组所设定的 Baud rate
btKeyText_ToolTip=设定蓝芽操控软体的触发字元
btModeCombo_ToolTip=OneShot: 一个字元讯息只会触发一次\nContinuous: 会不断触发直到动作被停止
btPortCombo_ToolTip=选择 86Duino 与蓝芽装置连线所用的串列埠
call_radioText=呼叫目标动作
capturebutton_Text=抓取舵机位置
capturebutton_ToolTip=注意！这个操作会先释放所有舵机并抓取舵机的读数。目前只支援 KONDO 舵机
CodeGenTab_Text=生成程式
commandsToolStripMenuItem_Text=编辑触发指令
CompRangeExplanation_Text=设定 IMU 补偿功能的有效角度 (0~180度，0表示关闭补偿功能)，只有在 (-设定值 ~ +设定值) 角度内，IMU 才会产生补偿值。
MotionControlExplanation_Text=选择此动作之轨迹规划方法。
DeleteAction=删除
DeleteMotion=删除动作
DuplicateFrame=复制并插入
DuplicateMotion=复制动作
EditMotion_ToolTip=更多选项
editToolStripMenuItem_Text=机器人组态
errorMsg1=无法传送讯息，请确认连线并重新启动
errorMsg2=无法开启 86Duino，进入离线模式
errorMsg3=无法读取图档，请确认档案
errorMsg4=开启档案并非 .rmb 档，无法开启
errorMsg5=损毁的档案，无法读取
errorMsg6=损毁的档案，请确认偏差值格式
errorMsg7=损毁的档案，请确认 Homeframe 格式
errorMsg8=损毁的档案，请确认舵机范围
errorMsg9=损毁的档案，请确认舵机设定
errorMsg10=损毁的档案，请确认 frame 相关设定
errorMsg11=损毁的档案，请确认延迟相关设定
errorMsg12=名称须以英文开头，并且不可输入特殊符号
errorMsg13=名称不可超过20字元
errorMsg14=名称不可含空白键
errorMsg15=请设定正确的延迟时间
errorMsg16=请先加入一个动作
errorMsg17=无法读取背景图片
errorMsg18=无法找到 86Duino，进入离线模式
errorMsg19=请输入实数
errorMsg20=请连接 IMU 到 86Duino 并在机器人组态中初始化
errorMsg21=IMU 初始化失败
errorMsg22=同名的动作已存在
errorMsg23=无法读取镜像档，请确认档案
errorMsg24=错误的版本，此档案版本为 86ME_v
errorMsg25=损毁的档案，请确认 IMU 相关设定
errorMsg26=此名称已被使用
errorMsg27=此变数或指令正被使用中
ESP8266BaudCombo_ToolTip=选择 ESP8266 模组所设定的 Baud rate
ESP8266KeyText_ToolTip=设定 ESP8266 操控软体的触发字串
ESP8266PortCombo_ToolTip=选择 86Duino 与 ESP8266 连线所用的串列埠
exitToolStripMenuItem_Text=离开
ExportMotion=汇出动作
fast_Text=快
fcheck_ToolTip=采用此伺服机
fileToolStripMenuItem_Text=新增专案
flag_xlabel=名称：
fonoff_ToolTip=开始或取消同步此伺服机
Generate_Text=机器人动作函式库
GenerateAllInOne_Text=合一机器人程式
GenerateFrame_Text=机器人 Frame 档
GenerateScratch_Text=Scratch 2.0 机器人专案
Generate_Description=选择欲储存机器人动作涵式库之目录：
GenerateAllInOne_Description=选择欲储存合一机器人程式之目录：
GenerateFrame_Description=选择欲储存机器人 Frame 档之目录：
GenerateScratch_Description=选择欲储存 Scratch 2.0 机器人专案之目录：
getAccData_Text=自动侦测
goto_xlabel=目标旗标：
goto_xlabel2=        启用
goto_xlabel3=跳转次数
goto_xlabel4=        无限跳转
gotoMotion_xlabel=目标动作：
gotoMotion_xlabel2=跳转方式：
gotoMotion_xlabel3=跳至目标动作并在结束後回到原动作（不支援递回呼叫）
gotoMotion_xlabel4=取消目前动作，直接跳转至目标动作
gotoMotion_xlabel5=***注意！此指令只对层级 0 的动作有效，且烧录到 86Duino 後才生效。***
helpToolStripMenuItem_Text=帮助
Hint_groupBox_Text=提示
hint1=\t\t\t    按下 "+" 之按钮来新增动作
hint2=调整舵机数值\n↓\n↓\n↓
hint3=1.左键点击标签 \"Ch XX\" 并拖曳至想要的位置\n2. 调整舵机数值\n↓\n↓
hint4=Homeframe 只能在 编辑->机器人组态 中设定
hint5=\n<--- 设定延迟
hint6=设定旗标名称\n↓\n↓\n↓
hint7=设定目标旗标名称与跳转次数\n↓\n↓\n↓
hint8=设定跳转的目标动作与方式。\n↓\n↓\n↓
hint9=\n\n\n\t\t\t\t\t设定动作触发条件 --->
hint10=设定目标旗标名称\n↓\n↓\n↓
hint11=\n\n\n\t\t\t在空白处按下右键并加入新指令 --->
hint12=\n\n      所使用的舵机并不支援这项功能
hint13=\n\n\n\t\t\t\t\t   设定动作属性 --->
hint14=\n\n\t\t此指令会使所有伺服机脱力！
hint15=选择算式与设定变数\n↓\n↓\n↓
hint16=设定判断式与目标旗标名称\n↓\n↓\n↓
howToUseToolStripMenuItem_Text=教程
ImportMotion=汇入动作
InsertIntermediateFrame=插入均值 Frame
jump_radioText=跳至目标动作
Keyboard_groupBox_Text=键盘
KeyboardTypeCombo_ToolTip=First Press: 在按下按键时触发\nPressed: 持续按住按键时触发\nRelease: 放开按键时触发
Main_label1_Text=指令类别：
Main_label2_Text=延迟：
Label2TextDelay=延迟：
Label2TextPlayTime=动作时间：
languageToolStripMenuItem_Text=语言
loadFrame_ToolTip=读取一个 Frame 档并设定到目前的 Frame
loadedText= 读取完成
Motion_groupBox_Text=动作
motion_pause_ToolTip=暂停；若要继续则再按一次播放
motion_stop_ToolTip=停止
motionLayerExplanation_Text=动作层级功能可使不同层级的动作同时被触发，使动作同时展现。而层级越高，优先权越高。
MotionNameLabel_Text=动作名称：
MotionProperty_Text=属性
MotionPropertyLabel_Text=设定目前动作之属性：
MotionTest_ToolTip=播放目前所选之动作
MotionTrigger_Text=触发条件
motorRelease_Text=释放舵机
motorRelease_ToolTip=注意！这将会释放所有舵机，使舵机脱力
move_down_ToolTip=下移所选指令
move_up_ToolTip=上移所选指令
Action_add_ToolTip=创建一个新的编辑指令
Action_del_ToolTip=删除此编辑指令
MoveActionDOWN=下移
MoveActionUP=上移
NewMotion_Text=新增动作
NewMotion_ToolTip=新增一个新的动作以供编辑
newToolStripMenuItem_Text=档案
nonblockinExplanation_Text=此动作执行时能被其他动作中断
optionsToolStripMenuItem_Text=编辑
preferenceToolStripMenuItem_Text=偏好设定
ps2_groupBox_Text=PS2 摇杆
ps2ATTCombo_Text=设定 ATT 脚位连接的 86Duino pin
ps2CLKCombo_Text=设定 CLK 脚位连接的 86Duino pin
ps2CMDCombo_Text=设定 CMD 脚位连接的 86Duino pin
ps2DATCombo_Text=设定 DAT 脚位连接的 86Duino pin
ps2TypeCombo_ToolTip=First Press: 在按下按键时触发\nPressed: 持续按住按键时触发\nRelease: 放开按键时触发
RenameMotion=重新命名
saveAsFileToolStripMenuItem_Text=另存专案...
saveFileToolStripMenuItem_Text=储存专案
saveFrame_ToolTip=储存目前的 Frame
saveMsg=储存变更？
saveMsg2=储存此专案？
Setting_groupBox_Text=编辑设定
slow_Text=慢
sync_speed_ToolTip=设定同步响应之动作速度
TitleMotion_ToolTip=此动作只在 86Duino 启动时触发一次
variablesToolStripMenuItem_Text=编辑变数
warning1=确定删除此动作？
wifi602PortCombo_ToolTip=选择 86Duino 与 wifi 装置连线所用的串列埠

# NewMotion
NewMotion_title=机器人组态
NewMotion_button3_Text=载入机器人图片
NewMotion_button4_Text=载入镜像组态
NewMotion_checkBox2_Text=Min / Max
NewMotion_fcheckText=同步
NewMotion_getQ_Text=自动侦测姿态
NewMotion_init_imu_Text=初始化 IMU
NewMotion_label1_Text=86Duino 型号： 
NewMotion_label2_Text=Offset (-256~255)
NewMotion_label3_Text=Home position
NewMotion_label4_Text=选择IMU：
NewMotion_label5_Text=初始姿态：
NewMotion_err1=错误：\n尚未选择 86Duino 型号
NewMotion_button4_ToolTip=载入含有伺服机成对关系之镜像档
NewMotion_fcheck_ToolTip=伺服机同步响应变更
NewMotion_minMax_ToolTip=启用/关闭修改伺服机动作范围
NewMotion_loadpic_ToolTip=载入您的机器人图片来辅助记忆伺服机的位置

# SetForm
SetForm_button2_Text=开始
SetForm_Exit_Text=离开
SetForm_textBox1_Text=选择 86Duino 所在的连接埠：